app/controllers/visitante_credenciados_controller.rb

SELECT "visitante_credenciados".* FROM "visitante_credenciados"
---
  def index
    @visitante_credenciados = VisitanteCredenciado.all

SELECT "visitante_credenciados".* FROM "visitante_credenciados" WHERE "visitante_credenciados"."id" = $1 LIMIT 1  [["id", "index"]]
---
  def show
    @visitante_credenciado = VisitanteCredenciado.find(params[:id])

INSERT INTO "visitante_credenciados" ("cpf", "created_at", "nascimento", "nome", "sexo", "sobrenome", "telefone", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @visitante_credenciado = VisitanteCredenciado.new(params[:visitante_credenciado])
    @visitante_credenciado.usuario = current_usuario

    respond_to do |format|
      if @visitante_credenciado.save

SELECT "visitante_credenciados".* FROM "visitante_credenciados" WHERE "visitante_credenciados"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "visitante_credenciados" WHERE "visitante_credenciados"."id" = $1  [["id", 1]]
---
  def destroy
    @visitante_credenciado = VisitanteCredenciados.find(params[:id])
    @visitante_credenciado.destroy